app/Controllers/Post.php

INSERT INTO `posts` (`body`, `author`, `img_url`, `is_published`) VALUES ('<h1>Heading for test post</h1>\r\n<hr/>\r\n<p>Lorem ipsum dolor sit amet huit nom cluit</p>', 'Nathaniel', 'https://images.unsplash.com/photo-1657299156653-d3c0147ba3ee?ixlib=rb-1.2.1&ixid=MnwxMjA3fDF8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=1470&q=80', '1')
---
  public function insert_post()
  {
    $model = new PostModel();
    // print_r($_POST);
    $model->insert($_POST);