app/Controllers/User.php

INSERT INTO `users` (`fullname`, `username`, `email`, `password`, `role`) VALUES ('Nathaniel Senje', 'senjenathaniel', 'topsailcashew@gmail.com', 'wTfc@r3s', '1')
---
  public function insert_record()
  {
    $model = new UserModel();
    $data = $_POST;
    $model->insert($data);