app/Models/PostModel.php

  public function getPosts($id = false)
  {
    if($id === false) {
      return $this->findAll();
---
SELECT *
FROM `posts`