app/Models/UserModel.php

SELECT *
FROM `users`
---
  public function getUsers($id = null)
  {
    if(!$id) {
      return $this->findAll();